#CNN
#1.卷积层——提取特征
#2.池化层——降维
#3.全连接层——分类


"""
1.卷积计算——线性点乘求和
input:输入图像
kernel:卷积核=1个神经元
output:卷积结果

卷积层的作用
1.提取特征：卷积层通过卷积操作能够提取输入数据中的局部特征，例如边缘、纹理等。这些特征对于图像识别和分类等任务非常重要。

2.参数共享：卷积层中的卷积核在整个输入图像上进行滑动，使用相同的权重进行计算。这种参数共享的机制大大减少了模型的参数数量，提高了训练效率。

3.空间不变性：卷积层能够捕捉输入数据中的空间关系，无论特征出现在图像的哪个位置，都能够被卷积核检测到。这使得卷积神经网络在处理图像等具有空间结构的数据时表现出色。

###步长：卷积核在输入图像上滑动的步长，步长越大，输出特征图的尺寸越小。也可以增大感受野，使得卷积核能够捕捉更大范围的特征。
###填充(Padding): 在输入图像的边缘添加额外的像素，以控制输出特征图的尺寸。常见的填充方式有零填充（zero padding）和镜像填充（mirror padding）。

"""

"""
多通道卷积——单卷积核
1.先对应通道做点乘，再求和
2.然后整体做加法


多卷积核
1.每个卷积核提取不同的特征
2.每个卷积核对应一个输出特征图
"""

"""
特征图😀

N=(W-F+2P/S)+1

W=输入图像的宽度
F=卷积核的大小
P=填充的像素数
S=步长
"""

"""
相关API


"""
#C:channel
#H:height
#W:width

import torch
import torch.nn as nn
import matplotlib.pyplot as plt

def dm_01():
    img=plt.imread("PyTestt/liziT.webp") #读取图像

    #把图像的形状从 HWC 转换为 CHW，思路：img--张量--转换维度
    img2=torch.tensor(img,dtype=torch.float32) #把图像转换为张量
    img2=img2.permute(2,0,1) #转换维度

    #因为这里只有1张图，所以需要在最前面添加1个维度，从CHW————(1,C,H,W)
    img3=img2.unsqueeze(0) #在最前面添加1个维度

    #创建卷积层对象 提取特征图
    conv=nn.Conv2d(in_channels=3,out_channels=4,kernel_size=3,stride=2,padding=0) #卷积层对象



    #进行卷积计算
    output=conv(img3)
    print(output.shape) #输出特征图的形状


    #可视化
    img4=output[0]
    img5=img4.permute(1,2,0) #转换维度,从CHW转换为HWC,这是因为matplotlib的imshow函数需要输入HWC格式的图像数据

    feature1=img5[:,:,0].detach().numpy() #第1个特征图
    plt.imshow(feature1) #可视化第1个特征图，因为卷积层的输出是一个张量，需要使用detach()方法将其从计算图中分离出来，然后使用numpy()方法将其转换为NumPy数组，最后使用imshow()函数进行可视化。
    plt.show()

if __name__ == "__main__":
    dm_01()



"""
池化
输入通道=输出通道

池化层的作用
1.降维：池化层通过对输入数据进行下采样，能够有效地降低特征图的尺寸，从而减少模型的计算量和参数数量。
2.提取主要特征：池化层能够保留输入数据中的主要特征，同时丢弃一些不重要的细节信息。这有助于提高模型的泛化能力和鲁棒性。
3.增强平移不变性：池化层能够增强模型对输入数据的平移不变性，即无论特征出现在图像的哪个位置，都能够被池化层检测到。这使得卷积神经网络在处理图像等具有空间结构的数据时表现出色。

方法
1.最大池化（Max Pooling）：在池化窗口内取最大值作为输出。
2.平均池化（Average Pooling）：在池化窗口内取平均值作为输出。
3.随机池化（Stochastic Pooling）：在池化窗口内随机选择一个值作为输出。
"""

#