#1. sigmod函数
"""
1. Sigmoid函数是一种常用的激活函数，定义为：
   f(x) = 1 / (1 + exp(-x))
   它的输出范围在0到1之间，常用于二分类问题的输出层。

2. Sigmoid函数的优点：
   - 输出范围在0到1之间，适合表示概率。
    - 可微分，便于反向传播算法的实现。

3. Sigmoid函数的缺点：
   - 当输入值较大或较小时，梯度会变得非常小，
        导致梯度消失问题，影响模型的训练。
    - 输出不以0为中心，可能导致梯度更新效率降低。

4. 在PyTorch中，可以使用torch.sigmoid函数来计算Sigmoid函数的值。
"""

#2.tanh函数
"""
1. Tanh函数是一种常用的激活函数，定义为：
   f(x) = (exp(x) - exp(-x)) / (exp(x) + exp(-x))
   它的输出范围在-1到1之间，常用于隐藏层的激活函数。

2. Tanh函数的优点：
   - 输出范围在-1到1之间，适合表示中心化的数据。
    - 可微分，便于反向传播算法的实现。

3. Tanh函数的缺点：
   - 当输入值较大或较小时，梯度会变得非常小，
        导致梯度消失问题，影响模型的训练。

4. 在PyTorch中，可以使用torch.tanh函数来计算Tanh函数的值。

通常在隐藏层中使用Tanh函数，而在输出层中使用Sigmoid函数，具体选择取决于任务的需求和数据的特性。
"""

"""
sigmoid和tanh函数的区别：
1. 输出范围：sigmoid函数的输出范围在0到1之间，而tanh函数的输出范围在-1到1之间。

2. 中心化：sigmoid函数的输出不以0为中心，而tanh函数的输出以0为中心。

3. 梯度消失：sigmoid函数在输入值较大或较小时，梯度会变得非常小，导致梯度消失问题；而tanh函数在输入值较大或较小时，梯度也会变得非常小，但相对于sigmoid函数来说，tanh函数的梯度消失问题较轻。

4. 应用场景：sigmoid函数常用于二分类问题的输出层，而tanh函数常用于隐藏层的激活函数。
"""

#3. Relu函数
"""
1. ReLU函数（Rectified Linear Unit）是一种常用的激活函数，定义为：
   f(x) = max(0, x)
    它的输出范围在0到正无穷之间，常用于隐藏层的激活函数。

2. ReLU函数的优点：
   - 计算简单，效率高。
    - 在正区间内具有较大的梯度，能够缓解梯度消失问题。
    
3. ReLU函数的缺点：
   - 对于负区间的输入，梯度为0，可能导致神经元死亡问题。
   - 输出不以0为中心，可能导致梯度更新效率降低。
   
"""

#4.softmax函数
"""
1. Softmax函数是一种常用的激活函数，定义为：
    f(x_i) = exp(x_i) / sum(exp(x_j)) for j=1 to n
    它的输出范围在0到1之间，且所有输出的和为1，常用于多分类问题的输出层。


    输出每个分支的概率值，表示输入属于每个类别的概率。
    选取最大的概率值对应的类别作为模型的预测结果。
    
2. Softmax函数的优点：
   - 输出范围在0到1之间，适合表示概率。
    - 可微分，便于反向传播算法的实现。

3. Softmax函数的缺点：
   - 当输入值较大时，可能导致数值稳定性问题。
   - 计算复杂度较高，尤其是在类别数量较多的情况下。

4. 在PyTorch中，可以使用torch.softmax函数来计算Softmax函数的值。
"""

